Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_UART4_Init();
  MX_UART5_Init();
  MX_UART7_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
  MX_SSD1680_Init();

  SSD1680_Border(&hepd, ColorWhite);
  SSD1680_Clear(&hepd, ColorWhite);
  SSD1680_Refresh(&hepd, REFRESH_MODE);

  HAL_NVIC_SetPriority(TIM1_UP_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(TIM1_UP_IRQn);
  HAL_TIM_Base_Start_IT(&htim1);

  HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(TIM2_IRQn);
  HAL_TIM_Base_Start_IT(&htim2);

  HAL_NVIC_SetPriority(UART5_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(UART5_IRQn);

  typedef struct
  {
      GPIO_TypeDef* port;
      uint16_t pin;
      GPIO_PinState state;
  }
  GpioSet;

  GpioSet list[] =
  {
      {BT_BLED_GPIO_Port,  BT_BLED_Pin,  GPIO_PIN_SET},
      {BT_RLED_GPIO_Port,  BT_RLED_Pin,  GPIO_PIN_RESET},
      {GPS_RLED_GPIO_Port, GPS_RLED_Pin, GPIO_PIN_RESET},
      {GPS_GLED_GPIO_Port, GPS_GLED_Pin, GPIO_PIN_SET},
      {WF_LED_GPIO_Port,   WF_LED_Pin,   GPIO_PIN_SET},
      {STA_LED_GPIO_Port,  STA_LED_Pin,  GPIO_PIN_SET},
      {EC_LED_GPIO_Port,   EC_LED_Pin,   GPIO_PIN_SET},
      {EC_RELAY_GPIO_Port, EC_RELAY_Pin, GPIO_PIN_RESET},
	  {EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET}
  };

  for (int i = 0; i < sizeof(list)/sizeof(list[0]); i++)
  {
      HAL_GPIO_WritePin(list[i].port, list[i].pin, list[i].state);
  }
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  HAL_UART_Receive_IT(&huart4, BTBuffer, 1);
  HAL_UART_Receive_IT(&huart5, WFBuffer, 1);
  HAL_UART_Receive_IT(&huart7, (uint8_t*)GPSBuffer, 1);

  // Start Define Variable
  uint8_t msg[] = "STM32 is now on\n";
  char input_train_type[10] = {0};
  char input_train_kind[20] = {0};
  char input_train_num[10] = {0};
  char input_date[16] = {0};
  char input_dept_time[10] = {0};
  char input_arr_time[10] = {0};
  char input_dept_sta[20] = {0};
  char input_arr_sta[20] = {0};
  char input_car[10] = {0};
  char input_seat[10] = {0};
  char input_price[10] = {0};
  //(char *train_type, char *train_kind, char *train_num, char *date, char *dept_time, char *dept_sta, char *arr_time, char *arr_sta, char *car, char *seat, char *price)

  double debug_array[9] = {24.167680, 120.653612, 17, 1072, 5, 1, 0, 0, 1};
  char *debug_ticket[5] = {"A50111562576561ZZZZ33003230ZZZZZ6ZP7UNxP7UNx15VNA000V7UF0F07", //台中->豐原
	  "N50049351999418ZZZZ10803300ZZZZZ3ZP1VLUP1VNI161NA004y1VHEA49", //桃園->台中
	  "0720412420244007936860000849004202508301834470072025083019154701000000300000030030030000000540006001INTIRS000020250830109ABE",  //台中->板橋
	  "0421511450742087503470000333004202505252215520072025052522475201000000100000080020010000000540006000INTETS000020250525101909",  //桃園->台中
	  "2902100093118070992280000845007202601091817000082026010918270001000000100000040100050000000130006001INTETS000020260109105067",

  };

  // End Define Variable

  if (DEBUG_MODE)
  {
	  	HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 1000);

	    result = mlp_forward_pass(debug_array[0], debug_array[1], debug_array[2], debug_array[3], debug_array[4], debug_array[5], debug_array[6], debug_array[7],debug_array[8]);

	    for (int i = 0; i < (sizeof(debug_ticket) / sizeof(debug_ticket[0])); i++)
	    {
	    	if (isalpha((unsigned)debug_ticket[i][0]))
	    	{
	    		strcpy(input_train_type, "TRA");
	    		if (debug_ticket[i][0] == 'A')  strcpy(input_train_kind, "Local");
	    		if (debug_ticket[i][0] == 'N')  strcpy(input_train_kind, "T.C.Exp.");
	    		strncpy(input_dept_sta, debug_ticket[i] + 19, 4);
	    		strncpy(input_arr_sta, debug_ticket[i] + 23, 4);
	    	}

	    	else
	    	{
	    		strcpy(input_train_type, "THSR");
	    		strcpy(input_train_kind, "Standard");
	    		strncpy(input_train_num, debug_ticket[i] + 24 , 4); // Train number
	    		strncpy(input_dept_sta, debug_ticket[i] + 29, 2);   // Departure station code
	    		input_dept_sta[2] = '\0';
	    		//input_dept_sta = sta_code_decoder(dept_sta_code);
	    		char raw_date[9] = {0};
	    		strncpy(raw_date, debug_ticket[i] + 31, 8);      // Date
	    		input_date[0] = raw_date[0];
	    		input_date[1] = raw_date[1];
	    		input_date[2] = raw_date[2];
	    		input_date[3] = raw_date[3];
	    		input_date[4] = '-';
	    		input_date[5] = raw_date[4];
	    		input_date[6] = raw_date[5];
	    		input_date[7] = '-';
	    		input_date[8] = raw_date[6];
	    		input_date[9] = raw_date[7];
	    		input_date[10] = '\0';

	    		strncpy(input_dept_time, debug_ticket[i] + 39, 4); // Departure time
	    		strncpy(input_arr_sta, debug_ticket[i] + 46, 2);    // Arrival station code
	    		input_arr_sta[2] = '\0';
	    		strncpy(input_arr_time, debug_ticket[i] + 56, 4);  // Arrival time
	    		strncpy(input_car, debug_ticket[i] + 76, 2);       // Car
	    		strncpy(input_seat, debug_ticket[i] + 79, 5);      // Seat
	    		strncpy(input_arr_sta, debug_ticket[i] + 90, 1);    // Price
	    	}

	    	//(char *train_type, char *train_kind, char *train_num, char *date, char *dept_time, char *dept_sta, char *arr_time, char *arr_sta, char *car, char *seat, char *price)
	    	epd_ticket_handler(input_train_type, input_train_kind, input_train_num, input_date, input_dept_time, input_dept_sta,
	    			input_arr_time, input_arr_sta, input_car, input_seat, input_price);

	    	//debug_disp();
	    	HAL_Delay(1000);
	    }
  }

