Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
  /*Configure GPIO pin : EPD_CS_Pin */
  GPIO_InitStruct.Pin = EPD_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(EPD_CS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : EPD_BUSY_Pin */
  GPIO_InitStruct.Pin = EPD_BUSY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(EPD_BUSY_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : GPS_RLED_Pin GPS_GLED_Pin */
  GPIO_InitStruct.Pin = GPS_RLED_Pin|GPS_GLED_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : EPD_EN_Pin */
  GPIO_InitStruct.Pin = EPD_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(EPD_EN_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
static void MX_SSD1680_Init(void)
{
    hepd.SPI_Handle = &hspi1;
    hepd.CS_Port = EPD_CS_GPIO_Port;
    hepd.CS_Pin  = EPD_CS_Pin;
    hepd.DC_Port = EPD_DC_GPIO_Port;
    hepd.DC_Pin  = EPD_DC_Pin;
    hepd.RESET_Port = EPD_RST_GPIO_Port;
    hepd.RESET_Pin  = EPD_RST_Pin;
    hepd.BUSY_Port  = EPD_BUSY_GPIO_Port;
    hepd.BUSY_Pin   = EPD_BUSY_Pin;
    hepd.Color_Depth = 1;
    hepd.SPI_Timeout = 100;
    hepd.Scan_Mode  = WideScan;
    hepd.Resolution_X = 152;
    hepd.Resolution_Y = 296;

    SSD1680_Init(&hepd);
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == UART4) // BT
    {
		HM10_Process(BTBuffer[0]);
		HAL_UART_Receive_IT(&huart4, BTBuffer, 1);
    }

    else if (huart->Instance == UART5) // WiFi
    {

    	HAL_UART_Transmit(&huart2, WFBuffer, 1, 100);
		HAL_UART_Receive_IT(&huart5, WFBuffer, 1);

		uint8_t byte = WFBuffer[wf_idx];

		// Debug: 顯示原始數據
		#if DEBUG_MODE
			if (byte >= ' ' && byte <= '~')
			{
				HAL_UART_Transmit(&huart2, &byte, 1, 10);
			}
			else if (byte == '\r')
			{
				uint8_t cr[] = "<CR>";
				HAL_UART_Transmit(&huart2, cr, 4, 10);
			}
			else if (byte == '\n')
			{
				uint8_t lf[] = "<LF>\r\n";
				HAL_UART_Transmit(&huart2, lf, 6, 10);
			}
		#endif

		if (wf_idx < WIFI_BUF_SIZE - 1)
		{
			wf_idx++;
		}
		else
		{
			Process_WiFi_Data();
		}

		// 檢查是否收到完整回應 (以 "OK" 結尾)
		if (wf_idx >= 2 &&
			WFBuffer[wf_idx-2] == 'O' &&
			WFBuffer[wf_idx-1] == 'K')
		{
			Process_WiFi_Data();
		}

		HAL_UART_Receive_IT(&huart5, &WFBuffer[wf_idx], 1);

    }

    else if (huart->Instance == UART7) // GPS
    {
    	//HAL_UART_Transmit(&huart2, GPSBuffer, 1, 100);
    	HAL_UART_Receive_IT(&huart7, GPSBuffer, 1);
        static uint8_t rx_byte;
        rx_byte = GPSBuffer[0];

        if (rx_byte == '\n' || rx_byte == '\r')
        {
            if (idx > 0)
            {
                GPSBuffer[idx] = '\0';
                parse_gpgga(GPSBuffer);
                idx = 0;
            }
        }

        else if (rx_byte >= ' ' && rx_byte <= '~')
        {
            if (idx < sizeof(GPSBuffer) - 1)
            {
                GPSBuffer[idx++] = rx_byte;
            }

            else
            {
                idx = 0;
            }
        }
        HAL_UART_Receive_IT(&huart7, (uint8_t*)&GPSBuffer[0], 1);
    }
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	if(htim->Instance == TIM1)
	{
		HAL_GPIO_TogglePin(STA_LED_GPIO_Port, STA_LED_Pin);
	}
	else if(htim->Instance == TIM2)
	{
		// WiFi 掃描
		#if DEBUG_MODE
			uint8_t text[] = "\r\n>>> Starting WiFi Scan <<<\r\n";
			HAL_UART_Transmit(&huart2, text, sizeof(text)-1, 100);
		#endif

		// 清空舊數據
		wf_idx = 0;
		wifi_count = 0;
		memset(WFBuffer, 0, WIFI_BUF_SIZE);
		memset(wifi_list, 0, sizeof(wifi_list));

		// 發送掃描指令
		uint8_t cmd[] = "AT+CWLAP\r\n";
		HAL_UART_Transmit(&huart5, cmd, sizeof(cmd)-1, 100);

		HAL_GPIO_TogglePin(WF_LED_GPIO_Port, WF_LED_Pin);
	}
}

void parse_gpgga(uint8_t *line)
{
	if (strncmp((const char *)line, "$GPGGA", 6) != 0 && strncmp((const char *)line, "$GNGGA", 6) != 0)
    {
        return;
    }

    int i = 0;
    char *token = strtok((char *)line, ",");

    while (token != NULL && i < 15) {
        size_t len = strlen(token);
        if (len > 15) len = 15;
        memcpy(parts[i], token, len);
        parts[i][len] = '\0';
        i++;
        token = strtok(NULL, ",");
    }
    if (i < 10)
    {
        return;
    }

    if (strlen(parts[6]) == 0 || parts[6][0] == '0')
    {
        return;
    }

    if (strlen(parts[2]) == 0) return;
    float rawLat = atof(parts[2]);
    if (rawLat == 0.0) return;

    int latDeg = (int)(rawLat / 100);
    float latMin = rawLat - latDeg * 100.0;
    float lat = latDeg + latMin / 60.0;

    if (strlen(parts[3]) > 0 && parts[3][0] == 'S')
    {
        lat = -lat;
    }

    if (strlen(parts[4]) == 0) return;
    float rawLon = atof(parts[4]);
    if (rawLon == 0.0) return;

    int lonDeg = (int)(rawLon / 100);
    float lonMin = rawLon - lonDeg * 100.0;
    float lon = lonDeg + lonMin / 60.0;

    if (strlen(parts[5]) > 0 && parts[5][0] == 'W') {
        lon = -lon;
    }

    float alt = (strlen(parts[9]) > 0) ? atof(parts[9]) : 0.0;

    int satellites = (strlen(parts[7]) > 0) ? atoi(parts[7]) : 0;

    float rawTime = (strlen(parts[1]) > 0) ? atof(parts[1]) : 0.0;
    uint8_t hour = ((int)rawTime / 10000) % 24;
    uint8_t minute = ((int)rawTime / 100) % 100;
    uint8_t second = (int)rawTime % 100;

    #if DEBUG_MODE
		char debug_msg[64];
		int len = snprintf(debug_msg, sizeof(debug_msg), "Lat:%.6f Lon:%.6f Alt:%.1fm Sat:%d\n%02d:%02d:%02d UTC\n", lat, lon, alt, satellites, hour, minute, second);

		if (len > 0 && len < sizeof(debug_msg))
		{
			HAL_UART_Transmit(&huart2, (uint8_t*)debug_msg, len, 1000);
		}
    #endif
}

void Handle_BT_Command(char* cmd)
{
    #if DEBUG_MODE
        char msg[64];
        int len = snprintf(msg, sizeof(msg), "\r\n[CMD] %s\r\n", cmd);
        HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
    #endif
}

void HM10_Process(uint8_t byte)
{
    // Debug: 顯示接收到的字符
    #if DEBUG_MODE
        HAL_UART_Transmit(&huart2, &byte, 1, 10);
    #endif

    // 加入緩衝區
    if (bt_idx < BT_BUF_SIZE - 1)
    {
        btrecv[bt_idx++] = byte;
        btrecv[bt_idx] = '\0';
    }
    else
    {
        // 滿了就重置
        bt_idx = 0;
        btrecv[0] = byte;
        btrecv[1] = '\0';
        bt_idx = 1;
    }

    // 檢查是否包含關鍵字（滑動窗口檢查）
    // 只檢查最後收到的部分

    // 方法：檢查緩衝區中是否出現 "CONN" 或 "LOST"
    if (strstr(btrecv, "CONN") != NULL)
    {
        // 連接成功
        HAL_GPIO_WritePin(BT_BLED_GPIO_Port, BT_BLED_Pin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(BT_RLED_GPIO_Port, BT_RLED_Pin, GPIO_PIN_SET);

        #if DEBUG_MODE
            uint8_t msg[] = "\r\n[BT] Connected\r\n";
            HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 100);
        #endif

        // 清空
        bt_idx = 0;
        memset(btrecv, 0, BT_BUF_SIZE);
    }
    else if (strstr(btrecv, "LOST") != NULL)
    {
        // 連接斷開
        HAL_GPIO_WritePin(BT_BLED_GPIO_Port, BT_BLED_Pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(BT_RLED_GPIO_Port, BT_RLED_Pin, GPIO_PIN_RESET);

        #if DEBUG_MODE
            uint8_t msg[] = "\r\n[BT] Disconnected\r\n";
            HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 100);
        #endif

        // 清空
        bt_idx = 0;
        memset(btrecv, 0, BT_BUF_SIZE);
    }

    // 處理用戶指令（換行結束）
    if (byte == '\n' || byte == '\r')
    {
        if (bt_idx > 1 && strstr(btrecv, "OK") == NULL)
        {
            // 不是 HM-10 狀態訊息，是用戶指令
            // 移除換行符
            while (bt_idx > 0 && (btrecv[bt_idx-1] == '\r' || btrecv[bt_idx-1] == '\n'))
            {
                btrecv[--bt_idx] = '\0';
            }

