Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
            if (bt_idx > 0)
            {
                Handle_BT_Command(btrecv);
            }
        }

        // 清空緩衝區
        bt_idx = 0;
        memset(btrecv, 0, BT_BUF_SIZE);
    }
}

void Parse_WiFi_Line(char* line)
{
    // 格式: +CWLAP:(3,"2F_Office_2.4G",-57,"58:11:22:61:d6:80",1,-29,0,4,4,7,1)
    //              ↑   ↑               ↑
    //              加密 SSID            RSSI

    char* ssid_start = strchr(line, '"');
    if (!ssid_start) return;
    ssid_start++; // 跳過第一個 "

    char* ssid_end = strchr(ssid_start, '"');
    if (!ssid_end) return;

    // 提取 SSID
    size_t ssid_len = ssid_end - ssid_start;
    if (ssid_len > 31) ssid_len = 31;

    char ssid[32];
    strncpy(ssid, ssid_start, ssid_len);
    ssid[ssid_len] = '\0';

    // 找到 RSSI (在第一個逗號之後)
    char* rssi_start = strchr(ssid_end, ',');
    if (!rssi_start) return;
    rssi_start++; // 跳過逗號

    int8_t rssi = atoi(rssi_start);

    // 檢查是否已存在
    for (int i = 0; i < wifi_count; i++)
    {
        if (strcmp(wifi_list[i].ssid, ssid) == 0)
        {
            // 更新 RSSI（取較強的）
            if (rssi > wifi_list[i].rssi)
            {
                wifi_list[i].rssi = rssi;
            }
            return;
        }
    }

    // 加入新的 WiFi
    if (wifi_count < MAX_WIFI_COUNT)
    {
        strncpy(wifi_list[wifi_count].ssid, ssid, 31);
        wifi_list[wifi_count].ssid[31] = '\0';
        wifi_list[wifi_count].rssi = rssi;
        wifi_count++;
    }
}

void Display_WiFi_List(void)
{
    if (wifi_count == 0)
    {
        #if DEBUG_MODE
            uint8_t msg[] = "No WiFi found\r\n";
            HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 100);
        #endif
        return;
    }

    #if DEBUG_MODE
        char msg[128];
        int len = snprintf(msg, sizeof(msg), "\r\n=== WiFi Scan (%d networks) ===\r\n", wifi_count);
        HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);

        for (int i = 0; i < wifi_count; i++)
        {
            len = snprintf(msg, sizeof(msg), "%d. %s: %d dBm\r\n",
                          i+1, wifi_list[i].ssid, wifi_list[i].rssi);
            HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
        }

        uint8_t end[] = "============================\r\n\r\n";
        HAL_UART_Transmit(&huart2, end, sizeof(end)-1, 100);
    #endif
}

void Process_WiFi_Data(void)
{
    // 將緩衝區轉為字串
    WFBuffer[wf_idx] = '\0';

    // 解析每一行
    char* line_start = (char*)WFBuffer;
    char* line_end;

    while ((line_end = strchr(line_start, '\n')) != NULL)
    {
        *line_end = '\0'; // 結束當前行

        // 檢查是否為 CWLAP 回應
        if (strstr(line_start, "+CWLAP:") != NULL)
        {
            #if DEBUG_MODE
                char msg[128];
                int len = snprintf(msg, sizeof(msg), "WiFi: %s\r\n", line_start);
                HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
            #endif

            Parse_WiFi_Line(line_start);
        }
        else if (strstr(line_start, "OK") != NULL)
        {
            // 掃描完成，顯示結果
            Display_WiFi_List();

            // 清空列表準備下次掃描
            wifi_count = 0;
            memset(wifi_list, 0, sizeof(wifi_list));
        }

        line_start = line_end + 1;
    }

    wf_idx = 0;
    memset(WFBuffer, 0, WIFI_BUF_SIZE);
}

void epd_ticket_handler(char *train_type, char *train_kind, char *train_num, char *date, char *dept_time,
						char *dept_sta, char *arr_time, char *arr_sta, char *car, char *seat, char *price)
{   //0 16 32 48 64 80 96 112 128 144 160 176 192 208 224 240 256 272 288 304
	//0 8 16 32 40 48 56 64 72 80 88 96 104 112 120 128 136 144 152 160
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	HAL_Delay(100);
	SSD1680_Clear(&hepd, ColorWhite);

	if (strcmp(train_type, "THSR") == 0)
	{
		SSD1680_Text(&hepd, 64, 0, "THSR", &cp866_8x16);
		generate_v7_upscale();
		SSD1680_SetRegion(&hepd, 8, 152, 144, 144, out_buffer, NULL);
	}
	else if (strcmp(train_type, "TRA") == 0)
	{
		SSD1680_Text(&hepd, 64, 0, "TRA ", &cp866_8x16);
		generate_upscaled_qr(145, 144, 5, version3);
		SSD1680_SetRegion(&hepd, 8, 152, 144, 145, out_buffer, NULL);
	}

	if (date != NULL)  SSD1680_Text(&hepd, 0, 16, date, &cp866_8x16);
	if (train_kind != NULL && strcmp(train_type, "TRA") == 0)  SSD1680_Text(&hepd, 88, 16, train_kind, &cp866_8x16);
	if (train_kind != NULL && (strcmp(train_type, "THSR") == 0)) SSD1680_Text(&hepd, 88, 16, train_kind, &cp866_8x8);
	if (train_num != NULL && (strcmp(train_type, "THSR") == 0))
	{
		if (train_num[0] == '0')  SSD1680_Text(&hepd, 88, 24, train_num + 1, &cp866_8x8);
		else  SSD1680_Text(&hepd, 88, 24, train_num, &cp866_8x8);
	}

	SSD1680_Text(&hepd, 88, 40, "Depart", &cp866_8x14);
	char convert_dept_time[6] = {0};
	convert_dept_time[0] = dept_time[0];
	convert_dept_time[1] = dept_time[1];
	convert_dept_time[2] = ':';
	convert_dept_time[3] = dept_time[2];
	convert_dept_time[4] = dept_time[3];
	convert_dept_time[5] = '\0';
	SSD1680_Text(&hepd, 88, 56, convert_dept_time, &cp866_8x16);
	SSD1680_Text(&hepd, 8, 40, sta_code_decoder(dept_sta), &cp866_8x16);

	SSD1680_SetRegion(&hepd, 32, 68, 16, 36, arrow, NULL);

	SSD1680_Text(&hepd, 88, 72, "Car", &cp866_8x16);
	if (car[0] == '0') SSD1680_Text(&hepd, 128, 72, car + 1, &cp866_8x16);
	else SSD1680_Text(&hepd, 128, 72, car, &cp866_8x16);

	SSD1680_Text(&hepd, 88, 88, "Seat", &cp866_8x16);
	char seat_decoded[4] = {0};
	seat_decoded[0] = seat[0];
	seat_decoded[1] = seat[1];
	switch (seat[4])
	{
		case '1':
			seat_decoded[2] = 'A';
			break;
		case '2':
			seat_decoded[2] = 'B';
			break;
		case '3':
			seat_decoded[2] = 'C';
			break;
		case '4':
			seat_decoded[2] = 'D';
			break;
		case '5':
			seat_decoded[2] = 'E';
			break;
		default:
			seat_decoded[2] = 0;
	}
	seat_decoded[3] = '\0';
	if (seat_decoded[0] == '0')  SSD1680_Text(&hepd, 128, 88, seat_decoded + 1, &cp866_8x16);
	else SSD1680_Text(&hepd, 128, 88, seat_decoded, &cp866_8x16);

	SSD1680_Text(&hepd, 88, 104, "Arrive", &cp866_8x14);
	char convert_arr_time[6] = {0};
	convert_arr_time[0] = arr_time[0];
	convert_arr_time[1] = arr_time[1];
	convert_arr_time[2] = ':';
	convert_arr_time[3] = arr_time[2];
	convert_arr_time[4] = arr_time[3];
	convert_arr_time[5] = '\0';
	SSD1680_Text(&hepd, 88, 118, convert_arr_time, &cp866_8x16);
	SSD1680_Text(&hepd, 8, 112, sta_code_decoder(arr_sta), &cp866_8x16);

	SSD1680_Refresh(&hepd, REFRESH_MODE);
	HAL_Delay(1000);
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
}

void debug_disp(void)
{
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	HAL_Delay(100);
	SSD1680_Text(&hepd,  0, 280, "Predict:", &cp866_8x16);
	char predict_str[12];
	sprintf(predict_str, "%d", result);
	SSD1680_Text(&hepd,  72, 280, predict_str, &cp866_8x16);
	SSD1680_Refresh(&hepd, REFRESH_MODE);
	HAL_Delay(1000);
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
}

void generate_upscaled_qr(uint16_t height, uint16_t width, uint8_t scale,const unsigned char qrcode[])
{
	memset(out_buffer, 0x00, sizeof(out_buffer));
	for (int y = 0; y < height; y++)
	{
		int src_y = y / scale;
		const uint8_t* row_ptr = &qrcode[src_y * 4];
		for (int x = 0; x < width; x++)
		{
			int src_x = x / scale;
			int byte_idx = src_x / 8;
			int bit_idx = 7 - (src_x % 8);
			int is_black = (row_ptr[byte_idx] >> bit_idx) & 1;

			if (is_black)
			{
				int row_offset = y * (width / 8);
				int buf_idx = row_offset + (x / 8);
				int bit_pos = 7 - (x % 8);

				out_buffer[buf_idx] |= (1 << bit_pos);
			}
		}
	}
}

void generate_v7_upscale()
{
	memset(out_buffer, 0xFF, 2592);

	    for (int y = 0; y < 45; y++) {
	        // 使用 6 Bytes Stride (既然 8 是全錯的，那 6 應該是對的)
	        const uint8_t* row_ptr = &version7[y * 6];

	        for (int x = 0; x < 45; x++) {

