Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
	            // --- 【關鍵修改】 ---
	            // 原本是 MSB: (row_ptr[x >> 3] >> (7 - (x & 7))) & 1;
	            // 改成 LSB 試試看 (從低位元讀起)：
	            int is_black = (row_ptr[x >> 3] >> (x & 7)) & 1;
	            // ------------------

	            if (is_black) {
	                // 放大 3 倍
	                int start_x = x * 3;
	                int start_y = y * 3;

	                for (int dy = 0; dy < 3; dy++) {
	                    int row_offset = (start_y + dy) * 18;
	                    for (int dx = 0; dx < 3; dx++) {
	                        int draw_x = start_x + dx;

	                        // 寫入 Output Buffer
	                        // 注意：Output 給螢幕通常還是維持 MSB (7 - bit)，除非螢幕也是反的
	                        out_buffer[row_offset + (draw_x >> 3)] &= ~(1 << (7 - (draw_x & 7)));
	                    }
	                }
	            }
	        }
	    }
}

char* sta_code_decoder(char *sta_code)
{
	int sta_code_int = atoi(sta_code);
	switch (sta_code_int)
	{
	    case 1:
	        return "Nangang";
	        break;
	    case 2:
	        return "Taipei";
	        break;
	    case 3:
	        return "Banqiao";
	        break;
	    case 4:
	        return "Taoyuan";
	        break;
	    case 5:
	        return "Hsinchu";
	        break;
	    case 6:
	        return "Miaoli";
	        break;
	    case 7:
	        return "Taichung";
	        break;
	    case 8:
	        return "Changhua";
	        break;
	    case 9:
	        return "Yunlin";
	        break;
	    case 10:
	        return "Chiayi";
	        break;
	    case 11:
	        return "Tainan";
	        break;
	    case 12:
	        return "Zuoying";
	        break;

		case 980:
			return "Nangang";    // 南港
			break;
		case 990:
			return "Songshan";   // 松山
			break;
		case 1000:
			return "Taipei";     // 台北
			break;
		case 1010:
			return "Wanhua";     // 萬華
			break;
		case 1020:
			return "Banqiao";    // 板橋
			break;
		case 1030:
			return "Fuzhou";     // 浮洲
			break;
		case 1040:
			return "Shulin";     // 樹林
			break;
		case 1050:
			return "South Shulin";// 南樹林
			break;
		case 1060:
			return "Shanjia";    // 山佳
			break;
		case 1070:
			return "Yingge";     // 鶯歌
			break;
		case 1080:
			return "Taoyuan";    // 桃園
			break;
		case 1090:
			return "Neili";      // 內壢
			break;
		case 1100:
			return "Zhongli";    // 中壢
			break;
		case 1110:
			return "Puxin";      // 埔心
			break;
		case 1120:
			return "Yangmei";    // 楊梅
			break;
		case 1130:
			return "Fugang";     // 富岡
			break;
		case 1140:
			return "Xinfu";      // 新富
			break;
		case 1150:
			return "Beihu";      // 北湖
			break;
		case 1160:
			return "Hukou";      // 湖口
			break;
		case 1170:
			return "Xinfeng";    // 新豐
			break;
		case 1180:
			return "Zhubei";     // 竹北
			break;
		case 1190:
			return "North Hsinchu"; // 北新竹
			break;
		case 1210:
			return "Hsinchu";    // 新竹
			break;
	    case 3220:
			return "Houli";     // 后里
			break;
		case 3230:
			return "Fengyuan";  // 豐原
			break;
		case 3240:
			return "Lilin";    // 栗林
			break;
		case 3250:
			return "Tanzi";     // 潭子
			break;
		case 3260:
			return "Toujiacuo"; // 頭家厝
			break;
		case 3270:
			return "Songzhu";   // 松竹
			break;
		case 3280:
			return "Taiyuan";   // 太原
			break;
		case 3290:
			return "Jingwu";    // 精武
			break;
		case 3300:
			return "Taichung";  // 台中
			break;
		case 3310:
			return "Wuquan";    // 五權
			break;
		case 3320:
			return "Daqing";    // 大慶
			break;
		case 3330:
			return "Wuri";      // 烏日
			break;
		case 3340:
			return "Xinwuri";   // 新烏日
			break;
		case 3350:
			return "Chenggong"; // 成功
			break;
		case 3360:
			return "Changhua";   // 彰化
			break;
		case 3370:
			return "Huatan";     // 花壇
			break;
		case 3380:
			return "Dacun";      // 大村
			break;
		case 3390:
			return "Yuanlin";    // 員林
			break;
		case 3400:
			return "Yongjing";   // 永靖
			break;
		case 3410:
			return "Shetou";     // 社頭
			break;
		case 3420:
			return "Tianzhong";  // 田中
		case 3430:
			return "Ershui";     // 二水
			break;
		case 3450:
			return "Linnei";     // 林內
		case 3460:
			return "Shizeng";    // 石榴
			break;
		case 3470:
			return "Douliu";     // 斗六
			break;

		case 4080:
			return "Chiayi";     // 嘉義
			break;
		case 4090:
			return "Shuishang";  // 水上
			break;
		case 4100:
			return "Nanjing";    // 南靖
			break;
		case 4110:
			return "Houbi";      // 後壁
			break;
		case 4120:
			return "Xinying";    // 新營
			break;
		case 4130:
			return "Liuying";    // 柳營
			break;
		case 4140:
			return "Linfengying"; // 林鳳營
			break;
		case 4150:
			return "Longtian";   // 隆田
			break;
		case 4160:
			return "Bahe";       // 拔林
			break;
		case 4170:
			return "Shanhua";    // 善化
			break;
		case 4180:
			return "Nanke";      // 南科
			break;
		case 4190:
			return "Xinshi";     // 新市
			break;
		case 4200:
			return "Yongkang";   // 永康
			break;
		case 4210:
			return "Daqiao";     // 大橋
			break;
		case 4220:
			return "Tainan";     // 台南
			break;
		case 4250:
			return "Bao'an";    // 保安
			break;
		case 4260:
			return "Rende";      // 仁德
			break;
		case 4270:
			return "Zhongzhou";  // 中洲
			break;
		case 4290: // 4280 跳號
			return "Dahu";       // 大湖
			break;
		case 4300:
			return "Lujia";      // 路竹
			break;
		case 4310:
			return "Gangshan";   // 岡山
			break;
		case 4320:
			return "Qiaotou";    // 橋頭
			break;
		case 4330:
			return "Nanzi";      // 楠梓
			break;
		case 4340:
			return "Xinzuoying"; // 新左營
			break;
		case 4350:
			return "Zuoying";    // 左營
			break;
		case 4360:
			return "Neiwei";     // 內惟
			break;
		case 4370:
			return "Museum of Fine Arts"; // 美術館
			break;
		case 4380:
			return "Gushan";     // 鼓山
			break;
		case 4390:
			return "Sankuaicuo"; // 三塊厝
			break;
		case 4400:
			return "Kaohsiung";  // 高雄
			break;

		case 1250:
			return "Zhunan";     // 竹南
			break;
		case 2110:
			return "Tanwen";     // 談文
			break;
		case 2120:
			return "Dashan";     // 大山
			break;
		case 2130:
			return "Houlong";    // 後龍
			break;
		case 2140:
			return "Longgang";   // 龍港
			break;
		case 2150:
			return "Baishatun";  // 白沙屯
			break;
		case 2160:
			return "Xinpu";      // 新埔
			break;
		case 2170:
			return "Tongxiao";   // 通霄
			break;
		case 2180:
			return "Yuanli";     // 苑裡
			break;
		case 2190:
			return "Rinan";      // 日南
			break;
		case 2200:
			return "Dajia";      // 大甲
			break;
		case 2210:
			return "Taichung Port"; // 臺中港
			break;
		case 2220:
			return "Qingshui";   // 清水
			break;
		case 2230:
			return "Shalu";      // 沙鹿
			break;
		case 2240:
			return "Longjing";   // 龍井
			break;
		case 2250:
			return "Dadu";       // 大肚
			break;
		case 2260:
			return "Zhuifen";    // 追分
			break;
	    default:
	        return sta_code;
	        break;
	}
}

void relu(float *data, int size) {
    for (int i = 0; i < size; i++) {
        if (data[i] < 0.0f) data[i] = 0.0f;
    }
}

void softmax(float *data, int size) {
    float max_val = data[0];
    for (int i = 1; i < size; i++) if (data[i] > max_val) max_val = data[i];
    float sum = 0.0f;
    for (int i = 0; i < size; i++) {
        data[i] = expf(data[i] - max_val);
        sum += data[i];
    }
    for (int i = 0; i < size; i++) data[i] /= sum;
}

int mlp_forward_pass(double current_lat, double current_lon, uint8_t hour_of_day, uint16_t min_of_day, uint8_t day_of_week, int time_to_dept, uint8_t is_ticket_reg, uint8_t is_entering, uint8_t is_exiting)
{
    float x[INPUT_DIM];
    x[0] = current_lat;
    x[1] = current_lon;
    x[2] = (float)hour_of_day;
    x[3] = (float)min_of_day;
    x[4] = (float)day_of_week;
    x[5] = (float)time_to_dept;
    x[6] = (float)is_ticket_reg;
    x[7] = (float)is_entering;
    x[8] = (float)is_exiting;

