Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
    float h1[HIDDEN_1];
    float h2[HIDDEN_2];
    float out[OUTPUT_DIM];

    // 2. 第一層前向傳播 (9 -> 64)
    for (int i = 0; i < HIDDEN_1; i++) {
        float sum = fc1_bias[i];
        for (int j = 0; j < INPUT_DIM; j++) {
            sum += x[j] * fc1_weight[i][j];
        }
        h1[i] = sum;
    }
    relu(h1, HIDDEN_1);

    // 3. 第二層前向傳播 (64 -> 32)
    for (int i = 0; i < HIDDEN_2; i++) {
        float sum = fc2_bias[i];
        for (int j = 0; j < HIDDEN_1; j++) {
            sum += h1[j] * fc2_weight[i][j];
        }
        h2[i] = sum;
    }
    relu(h2, HIDDEN_2);

    // 4. 第三層前向傳播 (32 -> 5)
    for (int i = 0; i < OUTPUT_DIM; i++) {
        float sum = fc3_bias[i];
        for (int j = 0; j < HIDDEN_2; j++) {
            sum += h2[j] * fc3_weight[i][j];
        }
        out[i] = sum;
    }

    // 5. 使用 Softmax 轉換為機率並挑選最大值
    softmax(out, OUTPUT_DIM);

    int best_class = 0;
    float max_p = out[0];
    for (int i = 1; i < OUTPUT_DIM; i++) {
        if (out[i] > max_p) {
            max_p = out[i];
            best_class = i;
        }
    }

    return best_class; // 回傳預測類別 (0~4)
}

/* USER CODE END 4 */

 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x0;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}



/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {

  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
